CREATE DATABASE  IF NOT EXISTS `cinema_db` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `cinema_db`;
-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 180.71.29.2    Database: cinema_db
-- ------------------------------------------------------
-- Server version	5.7.44

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `screen`
--

DROP TABLE IF EXISTS `screen`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `screen` (
  `screenIdx` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '상영관 고유 ID',
  `theaterIdx` bigint(20) NOT NULL COMMENT '극장 ID',
  `screenName` varchar(20) NOT NULL COMMENT '상영관 이름',
  `screenType` tinyint(1) NOT NULL COMMENT '상영관 유형 (1: COMFORT, 2: VIP, 3: DOLBY, 4: 4DX, 5: IMAX)',
  `screenSeatCount` int(5) NOT NULL COMMENT '좌석 수',
  `screenStatus` tinyint(1) NOT NULL DEFAULT '0' COMMENT '상영관 상태 (0: 운영 중, 1: 점검, 2: 폐쇄)',
  PRIMARY KEY (`screenIdx`),
  KEY `theaterIdx` (`theaterIdx`),
  CONSTRAINT `screen_ibfk_1` FOREIGN KEY (`theaterIdx`) REFERENCES `theater` (`theaterIdx`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=161 DEFAULT CHARSET=utf8 COMMENT='극장 상영관 정보를 저장하는 테이블';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `screen`
--

LOCK TABLES `screen` WRITE;
/*!40000 ALTER TABLE `screen` DISABLE KEYS */;
INSERT INTO `screen` VALUES (1,1,'컴포트 시네마 1관',1,20,2),(2,1,'더 부티크 2관',2,20,0),(3,1,'돌비 시네마 3관',3,20,0),(4,1,'골드 클래스 4DX 4관',4,24,0),(5,1,'프리미엄 IMAX 5관',5,24,0),(6,1,'컴포트 시네마 6관',1,20,0),(7,1,'더 부티크 7관',2,20,0),(8,1,'돌비 시네마 8관',3,20,0),(9,1,'골드 클래스 4DX 9관',4,24,0),(10,1,'프리미엄 IMAX 10관',5,24,0),(11,2,'컴포트 시네마 1관',1,20,0),(12,2,'더 부티크 2관',2,20,0),(13,2,'돌비 시네마 3관',3,20,0),(14,2,'골드 클래스 4DX 4관',4,24,0),(15,2,'프리미엄 IMAX 5관',5,24,0),(16,2,'컴포트 시네마 6관',1,20,0),(17,2,'더 부티크 7관',2,20,0),(18,2,'돌비 시네마 8관',3,20,0),(19,2,'골드 클래스 4DX 9관',4,24,0),(20,2,'프리미엄 IMAX 10관',5,24,0),(21,3,'컴포트 시네마 1관',1,20,0),(22,3,'더 부티크 2관',2,20,0),(23,3,'돌비 시네마 3관',3,20,0),(24,3,'골드 클래스 4DX 4관',4,24,0),(25,3,'프리미엄 IMAX 5관',5,24,0),(26,3,'컴포트 시네마 6관',1,20,0),(27,3,'더 부티크 7관',2,20,0),(28,3,'돌비 시네마 8관',3,20,0),(29,3,'골드 클래스 4DX 9관',4,24,0),(30,3,'프리미엄 IMAX 10관',5,24,0),(31,4,'컴포트 시네마 1관',1,20,0),(32,4,'더 부티크 2관',2,20,0),(33,4,'돌비 시네마 3관',3,20,0),(34,4,'골드 클래스 4DX 4관',4,24,0),(35,4,'프리미엄 IMAX 5관',5,24,0),(36,4,'컴포트 시네마 6관',1,20,0),(37,4,'더 부티크 7관',2,20,0),(38,4,'돌비 시네마 8관',3,20,0),(39,4,'골드 클래스 4DX 9관',4,24,0),(40,4,'프리미엄 IMAX 10관',5,24,0),(41,5,'컴포트 시네마 1관',1,20,0),(42,5,'더 부티크 2관',2,20,0),(43,5,'돌비 시네마 3관',3,20,0),(44,5,'골드 클래스 4DX 4관',4,24,0),(45,5,'프리미엄 IMAX 5관',5,24,0),(46,5,'컴포트 시네마 6관',1,20,0),(47,5,'더 부티크 7관',2,20,0),(48,5,'돌비 시네마 8관',3,20,0),(49,5,'골드 클래스 4DX 9관',4,24,0),(50,5,'프리미엄 IMAX 10관',5,24,0),(51,6,'컴포트 시네마 1관',1,20,0),(52,6,'더 부티크 2관',2,20,0),(53,6,'돌비 시네마 3관',3,20,0),(54,6,'골드 클래스 4DX 4관',4,24,0),(55,6,'프리미엄 IMAX 5관',5,24,0),(56,6,'컴포트 시네마 6관',1,20,0),(57,6,'더 부티크 7관',2,20,0),(58,6,'돌비 시네마 8관',3,20,0),(59,6,'골드 클래스 4DX 9관',4,24,0),(60,6,'프리미엄 IMAX 10관',5,24,0),(61,7,'컴포트 시네마 1관',1,20,0),(62,7,'더 부티크 2관',2,20,0),(63,7,'돌비 시네마 3관',3,20,0),(64,7,'골드 클래스 4DX 4관',4,24,0),(65,7,'프리미엄 IMAX 5관',5,24,0),(66,7,'컴포트 시네마 6관',1,20,0),(67,7,'더 부티크 7관',2,20,0),(68,7,'돌비 시네마 8관',3,20,0),(69,7,'골드 클래스 4DX 9관',4,24,0),(70,7,'프리미엄 IMAX 10관',5,24,0),(71,8,'컴포트 시네마 1관',1,20,0),(72,8,'더 부티크 2관',2,20,0),(73,8,'돌비 시네마 3관',3,20,0),(74,8,'골드 클래스 4DX 4관',4,24,0),(75,8,'프리미엄 IMAX 5관',5,24,0),(76,8,'컴포트 시네마 6관',1,20,0),(77,8,'더 부티크 7관',2,20,0),(78,8,'돌비 시네마 8관',3,20,0),(79,8,'골드 클래스 4DX 9관',4,24,0),(80,8,'프리미엄 IMAX 10관',5,24,0),(81,9,'컴포트 시네마 1관',1,20,0),(82,9,'더 부티크 2관',2,20,0),(83,9,'돌비 시네마 3관',3,20,0),(84,9,'골드 클래스 4DX 4관',4,24,0),(85,9,'프리미엄 IMAX 5관',5,24,0),(86,9,'컴포트 시네마 6관',1,20,0),(87,9,'더 부티크 7관',2,20,0),(88,9,'돌비 시네마 8관',3,20,0),(89,9,'골드 클래스 4DX 9관',4,24,0),(90,9,'프리미엄 IMAX 10관',5,24,0),(91,10,'컴포트 시네마 1관',1,20,0),(92,10,'더 부티크 2관',2,20,0),(93,10,'돌비 시네마 3관',3,20,0),(94,10,'골드 클래스 4DX 4관',4,24,0),(95,10,'프리미엄 IMAX 5관',5,24,0),(96,10,'컴포트 시네마 6관',1,20,0),(97,10,'더 부티크 7관',2,20,0),(98,10,'돌비 시네마 8관',3,20,0),(99,10,'골드 클래스 4DX 9관',4,24,0),(100,10,'프리미엄 IMAX 10관',5,24,0),(101,11,'컴포트 시네마 1관',1,20,0),(102,11,'더 부티크 2관',2,20,0),(103,11,'돌비 시네마 3관',3,20,0),(104,11,'골드 클래스 4DX 4관',4,24,0),(105,11,'프리미엄 IMAX 5관',5,24,0),(106,11,'컴포트 시네마 6관',1,20,0),(107,11,'더 부티크 7관',2,20,0),(108,11,'돌비 시네마 8관',3,20,0),(109,11,'골드 클래스 4DX 9관',4,24,0),(110,11,'프리미엄 IMAX 10관',5,24,0),(111,12,'컴포트 시네마 1관',1,20,0),(112,12,'더 부티크 2관',2,20,0),(113,12,'돌비 시네마 3관',3,20,0),(114,12,'골드 클래스 4DX 4관',4,24,0),(115,12,'프리미엄 IMAX 5관',5,24,0),(116,12,'컴포트 시네마 6관',1,20,0),(117,12,'더 부티크 7관',2,20,0),(118,12,'돌비 시네마 8관',3,20,0),(119,12,'골드 클래스 4DX 9관',4,24,0),(120,12,'프리미엄 IMAX 10관',5,24,0),(121,13,'컴포트 시네마 1관',1,20,0),(122,13,'더 부티크 2관',2,20,0),(123,13,'돌비 시네마 3관',3,20,0),(124,13,'골드 클래스 4DX 4관',4,24,0),(125,13,'프리미엄 IMAX 5관',5,24,0),(126,13,'컴포트 시네마 6관',1,20,0),(127,13,'더 부티크 7관',2,20,0),(128,13,'돌비 시네마 8관',3,20,0),(129,13,'골드 클래스 4DX 9관',4,24,0),(130,13,'프리미엄 IMAX 10관',5,24,0),(131,14,'컴포트 시네마 1관',1,20,0),(132,14,'더 부티크 2관',2,20,0),(133,14,'돌비 시네마 3관',3,20,0),(134,14,'골드 클래스 4DX 4관',4,24,0),(135,14,'프리미엄 IMAX 5관',5,24,0),(136,14,'컴포트 시네마 6관',1,20,0),(137,14,'더 부티크 7관',2,20,0),(138,14,'돌비 시네마 8관',3,20,0),(139,14,'골드 클래스 4DX 9관',4,24,0),(140,14,'프리미엄 IMAX 10관',5,24,0),(141,15,'컴포트 시네마 1관',1,20,0),(142,15,'더 부티크 2관',2,20,0),(143,15,'돌비 시네마 3관',3,20,0),(144,15,'골드 클래스 4DX 4관',4,24,0),(145,15,'프리미엄 IMAX 5관',5,24,0),(146,15,'컴포트 시네마 6관',1,20,0),(147,15,'더 부티크 7관',2,20,0),(148,15,'돌비 시네마 8관',3,20,0),(149,15,'골드 클래스 4DX 9관',4,24,0),(150,15,'프리미엄 IMAX 10관',5,24,0),(151,16,'컴포트 시네마 1관',1,20,0),(152,16,'더 부티크 2관',2,20,0),(153,16,'돌비 시네마 3관',3,20,0),(154,16,'골드 클래스 4DX 4관',4,24,0),(155,16,'프리미엄 IMAX 5관',5,24,0),(156,16,'컴포트 시네마 6관',1,20,0),(157,16,'더 부티크 7관',2,20,0),(158,16,'돌비 시네마 8관',3,20,0),(159,16,'골드 클래스 4DX 9관',4,24,0),(160,16,'프리미엄 IMAX 10관',5,24,0);
/*!40000 ALTER TABLE `screen` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-16 19:51:08
