CREATE DATABASE  IF NOT EXISTS `cinema_db` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `cinema_db`;
-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: 180.71.29.2    Database: cinema_db
-- ------------------------------------------------------
-- Server version	5.7.44

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `review`
--

DROP TABLE IF EXISTS `review`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `review` (
  `reviewIdx` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '리뷰 고유 ID',
  `userIdx` bigint(20) NOT NULL COMMENT '사용자 ID',
  `movieIdx` bigint(20) NOT NULL COMMENT '영화 ID',
  `reviewRating` int(11) NOT NULL COMMENT '영화 평점 (1~10 정수)',
  `reviewContent` text NOT NULL COMMENT '리뷰 내용',
  `reviewDate` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '리뷰 작성일',
  `reviewStatus` tinyint(1) NOT NULL DEFAULT '0' COMMENT '리뷰 상태 (0: 게시 중, 1: 삭제)',
  PRIMARY KEY (`reviewIdx`),
  KEY `userIdx` (`userIdx`),
  KEY `movieIdx` (`movieIdx`),
  CONSTRAINT `review_ibfk_1` FOREIGN KEY (`userIdx`) REFERENCES `user` (`userIdx`) ON DELETE CASCADE,
  CONSTRAINT `review_ibfk_2` FOREIGN KEY (`movieIdx`) REFERENCES `movie` (`movieIdx`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=116 DEFAULT CHARSET=utf8 COMMENT='영화에 대한 리뷰 정보를 저장하는 테이블';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `review`
--

LOCK TABLES `review` WRITE;
/*!40000 ALTER TABLE `review` DISABLE KEYS */;
INSERT INTO `review` VALUES (31,1,2,8,'정말 재미있는 영화였습니다!','2025-01-22 14:30:00',0),(32,2,2,9,'스토리와 액션이 훌륭했습니다.','2025-01-22 16:20:00',0),(33,3,2,7,'배우들의 연기가 좋았어요.','2025-01-22 18:45:00',0),(34,4,2,6,'기대보다는 살짝 아쉬웠지만 괜찮아요.','2025-01-22 20:15:00',0),(35,5,2,8,'코미디가 정말 유쾌했습니다!','2025-01-23 10:30:00',0),(36,6,2,9,'시간 가는 줄 모르고 봤습니다.','2025-01-23 12:10:00',0),(37,7,2,7,'액션 씬이 인상적이었어요.','2025-01-23 14:50:00',0),(38,8,2,10,'완벽한 영화였습니다!','2025-01-23 17:40:00',0),(39,9,2,8,'가족과 함께 보기 좋네요.','2025-01-23 19:15:00',0),(40,10,2,9,'영화가 끝난 후 여운이 남아요.','2025-01-23 21:30:00',0),(41,11,2,6,'조금 더 길었으면 좋았을 것 같아요.','2025-01-24 10:45:00',0),(42,12,2,8,'추천할 만한 영화입니다.','2025-01-24 12:25:00',0),(43,13,2,7,'조금은 뻔한 스토리.','2025-01-24 14:50:00',0),(44,14,2,9,'다시 보고 싶은 영화!','2025-01-24 17:20:00',0),(45,15,2,10,'최고의 영화였습니다.','2025-01-24 19:50:00',0),(46,1,4,10,'아이유의 콘서트를 스크린에서 볼 수 있어서 감동이었습니다.','2025-01-24 10:30:00',0),(47,2,4,9,'음향과 화면이 정말 좋았어요.','2025-01-24 12:20:00',0),(48,3,4,10,'최고의 콘서트 영화였습니다.','2025-01-24 14:45:00',0),(49,4,4,8,'현장의 감동이 잘 전달되었어요.','2025-01-24 16:50:00',0),(50,5,4,9,'콘서트의 생동감이 그대로 느껴졌습니다.','2025-01-24 18:15:00',0),(51,6,4,10,'아이유 팬이라면 꼭 보세요.','2025-01-24 19:40:00',0),(52,7,4,7,'다소 지루한 부분도 있었지만 괜찮았어요.','2025-01-24 20:10:00',0),(53,8,4,9,'영상미가 뛰어나네요.','2025-01-24 20:30:00',0),(54,9,4,8,'아이유의 노래가 너무 좋았어요.','2025-01-24 20:40:00',0),(55,10,4,10,'현장감이 정말 대단합니다.','2025-01-24 21:30:00',0),(56,11,4,9,'다시 보고 싶은 영화입니다.','2025-01-24 22:10:00',0),(57,12,4,8,'감동적인 콘서트 영화!','2025-01-24 22:50:00',0),(58,13,4,9,'정말 감동받았습니다.','2025-01-24 23:25:00',0),(59,14,4,10,'아이유 최고!','2025-01-24 23:45:00',0),(60,15,4,8,'음향 효과가 대단했어요.','2025-01-24 23:55:00',0),(61,1,5,8,'역사적인 배경이 감동적이었습니다.','2024-12-24 10:30:00',0),(62,2,5,9,'현빈의 연기가 정말 뛰어났어요.','2024-12-24 12:45:00',0),(63,3,5,7,'스토리가 다소 뻔하지만 괜찮았어요.','2024-12-24 14:00:00',0),(64,4,5,6,'기대만큼은 아니었지만 볼 만했어요.','2024-12-24 16:30:00',0),(65,5,5,8,'배경 음악이 인상적이었습니다.','2024-12-24 18:00:00',0),(66,6,5,9,'감동적인 순간들이 많았어요.','2024-12-24 20:15:00',0),(67,7,5,7,'조금은 지루한 부분도 있었지만 괜찮았어요.','2024-12-24 21:45:00',0),(68,8,5,10,'완벽한 역사 영화!','2024-12-25 10:00:00',0),(69,9,5,8,'가족과 함께 보기 좋은 영화였습니다.','2024-12-25 13:30:00',0),(70,10,5,9,'감동적인 이야기였습니다.','2024-12-25 15:20:00',0),(71,11,5,6,'조금 더 긴장감이 있었으면 좋았을 것 같아요.','2024-12-25 17:10:00',0),(72,12,5,8,'추천할 만한 영화입니다.','2024-12-25 19:45:00',0),(73,13,5,7,'조금은 평범한 느낌도 있었어요.','2024-12-25 20:30:00',0),(74,14,5,9,'다시 보고 싶은 영화!','2024-12-25 22:10:00',0),(75,15,5,10,'역사와 감동이 있는 영화입니다.','2024-12-25 23:50:00',0),(76,16,5,8,'전투 장면이 인상적이었습니다.','2024-12-26 11:00:00',0),(77,17,5,9,'잘 만들어진 영화였습니다.','2024-12-26 12:45:00',0),(78,18,5,7,'조금 아쉬운 부분도 있었어요.','2024-12-26 14:30:00',0),(79,19,5,6,'평범한 역사 영화였습니다.','2024-12-26 16:15:00',0),(80,20,5,8,'시대 배경이 잘 묘사되었어요.','2024-12-26 18:00:00',0),(81,21,5,9,'배우들의 연기가 정말 좋았어요.','2024-12-26 20:45:00',0),(82,22,5,7,'스토리가 조금 아쉬웠습니다.','2024-12-26 22:30:00',0),(83,23,5,10,'명작이라고 할 수 있어요.','2024-12-27 10:15:00',0),(84,24,5,8,'추천드리고 싶은 영화입니다.','2024-12-27 12:00:00',0),(85,25,5,9,'흥미진진한 내용이었습니다.','2024-12-27 14:30:00',0),(86,26,5,7,'다소 늘어지는 부분도 있었어요.','2024-12-27 16:20:00',0),(87,27,5,6,'조금 더 생동감이 있었으면 좋았을 것 같아요.','2024-12-27 18:15:00',0),(88,28,5,8,'시각적으로 아름다운 영화였습니다.','2024-12-27 20:00:00',0),(89,29,5,9,'배우들의 열연이 돋보였습니다.','2024-12-27 22:10:00',0),(90,30,5,7,'조금은 진부한 스토리였어요.','2024-12-28 10:00:00',0),(91,31,5,10,'영화가 끝난 후 여운이 길게 남았습니다.','2024-12-28 11:30:00',0),(92,32,5,8,'역사적 배경이 잘 살려졌습니다.','2024-12-28 13:15:00',0),(93,33,5,9,'가슴 뭉클한 이야기였습니다.','2024-12-28 15:10:00',0),(94,34,5,6,'조금 더 긴장감이 필요했어요.','2024-12-28 17:00:00',0),(95,35,5,8,'잘 만들어진 역사 영화였습니다.','2024-12-28 19:20:00',0),(96,36,5,9,'추천하고 싶은 영화입니다.','2024-12-28 20:40:00',0),(97,37,5,7,'조금은 평범했지만 괜찮았어요.','2024-12-28 22:30:00',0),(98,38,5,10,'감동적인 영화였습니다.','2024-12-29 11:00:00',0),(99,39,5,8,'전쟁의 비극을 잘 담아냈어요.','2024-12-29 13:15:00',0),(100,40,5,9,'역사에 대해 생각하게 되는 영화였습니다.','2024-12-29 15:00:00',0),(101,41,5,6,'다소 느린 진행이 아쉬웠습니다.','2024-12-29 16:45:00',0),(102,42,5,8,'강렬한 인상을 남긴 영화입니다.','2024-12-29 18:30:00',0),(103,43,5,9,'배우들의 열연이 돋보였어요.','2024-12-29 20:15:00',0),(104,44,5,7,'조금은 진부한 스토리였어요.','2024-12-29 22:10:00',0),(105,45,5,10,'감동적인 순간들이 많았습니다.','2024-12-30 10:30:00',0),(106,46,5,8,'영화의 전개가 인상적이었습니다.','2024-12-30 12:20:00',0),(107,47,5,9,'마지막 장면이 특히 좋았습니다.','2024-12-30 14:15:00',0),(108,48,5,6,'다소 지루한 부분도 있었지만 괜찮았어요.','2024-12-30 16:00:00',0),(109,49,5,8,'역사와 예술이 만난 작품입니다.','2024-12-30 18:10:00',0),(110,50,5,9,'깊은 여운이 남는 영화였습니다.','2024-12-30 20:00:00',0),(113,1,1,10,'실관람평 테스트 포인트','2025-02-03 19:11:58',0),(114,179,1,10,'더 글로리의 송혜교가 생각나는 영화였습니다.\n재밌게 잘 봤습니다.','2025-02-10 10:37:46',0),(115,191,2,9,'재미가 있다 만 영화','2025-02-10 14:15:48',0);
/*!40000 ALTER TABLE `review` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-16 19:51:07
